In [3]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text

In [2]:
connection_method = 'mysql+pymysql'
db_user = 'root'
db_password = 'mysql'
db_host = '127.0.0.1'
db_port = '3306'
db_name = 'lego'
engine = create_engine(f'{connection_method}://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}', pool_pre_ping=True, future=True)

In [4]:


with engine.connect() as conn:
    check = conn.execute(text("SHOW TABLES"))
    for row in check:
        print(row)

('colors',)
('inventories',)
('inventory_parts',)
('inventory_sets',)
('part_categories',)
('parts',)
('sets',)
('themes',)

In [ ]:
# Selecting Values
# Select the name and part_num columns from the parts table. Show only names that include the substring 'Hair', and order them with the part_num in descending order

# stmt = select([table1.c.myid]).where(table1.c.myid == table2.c.otherid)

with engine.connect() as conn:
    check = conn.execute(text("SELECT p.name, p.part_num FROM parts"))
    for row in check:
        print(row)

In [ ]:
use lego;

# Select the name and part_num columns from the parts table. Show only names that include the substring 'Hair', and order them with the part_num in descending order



SELECT p.name, p.part_num
FROM parts p
WHERE p.name LIKE '%hair%'
GROUP BY part_num DESC;

In [ ]:
# From the sets table, select all the sets that included the word 'Showdown' in the name between 1990 and 2015


SELECT s.name, s.year
FROM sets s
WHERE s.name like '%showdown%' AND s.year BETWEEN 1990 and 2015
GROUP BY s.year;

In [ ]:
# Aliasing the part_categories table as p, show the id and name of the values in that table where the name includes the word 'Bricks'

SELECT p.id, p.name
FROM part_categories p
WHERE p.name like '%bricks%';

In [ ]:
# Select all the ids from the themes table where the name is in 'Pirates' or 'Star Wars'. 
# This is your subquery. Then show the names of all the sets where the theme_id matches an 
# id in that subquery.

SELECT s.name, s.theme_id
FROM sets s
Where theme_id in
(SELECT t.id
 	FROM themes t
 	WHERE t.name in ('pirates', 'star wars') 
 	AND s.theme_id = t.id);

In [ ]:

# !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!


# !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

# elect the ids of the values in the inventories table that
# have more than one version (i.e. version > 1). This is your
# subquery. 

# Then select everything from the inventory_parts
# table where the inventory_id matches an id in that subquery.
# Limit the output to 10 rows.

SELECT *
FROM inventory_parts i_p
WHERE i_p.inventory_id = inventories.id
  (SELECT i.set_num, i.id, COUNT(i.id) multi
  FROM inventories i
  GROUP BY i.id, i_p.inventory_id LIMIT 10
  HAVING multi >1);



# !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
SELECT * COUNT(i.id) order_count 
FROM inventory_parts ip 
 
GROUP BY i.id
HAVING order_count >2;

# !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

In [ ]:

# Aliasing the sets table as 's', select the year and name 
# of the values in that table that include the substring 
# 'Batman'. Concatenate three exclamation marks to the end 
# of each name, and make all the names upper case.
SELECT year, CONCAT(UPPER(s.name), '!!!') as names_cap 
FROM sets s
WHERE name like '%batman%';

In [ ]:
# For every quantity value greater than 1 in the inventory_parts table, double the value 
# of the quantity. Limit your output to 20 rows, and order it by quantity.
SELECT
    quantity,
    quantity * 2 AS doubled
FROM inventory_parts 
WHERE quantity > 1
ORDER BY quantity DESC LIMIT 20;

In [ ]:
# Selecting from the sets table: - Select the name and year column. 
# Construct an additional column in your SELECT clause using the MySQL MAKEDATE() function. 
# This column's value should be a date corresponding to January 1st of the year. Hint: You 
# should use the year column and day 1 with MAKEDATE(). Read the MySQL documentation for MAKEDATE().

SELECT s.name, s.year, MAKEDATE(s.year,1) as the_first
FROM sets s;